lib/tasks/demo.rake

SELECT COUNT(*) FROM "strategies"
SELECT "strategies".* FROM "strategies" WHERE "strategies"."key" = 'tit_for_tat' LIMIT 1
SELECT "groups".* FROM "groups" WHERE "groups"."session_id" = 1 AND "groups"."name" = 'Los Tigres' LIMIT 1
INSERT INTO "groups" ("created_at", "name", "pin_digest", "session_id", "updated_at") VALUES ('2026-08-23 22:15:52.013369', 'Los Tigres', '$2a$12$VYqYgZCpnxRTNKvJECI08uX2tO3GxYpmZi5rAvYpzI85.eBi2Z0oW', 1, '2026-08-23 22:15:52.013369') RETURNING "id"
---
  task setup: :environment do
    # Ensure strategies are seeded
    if Strategy.count < 8
      puts "Sembrando estrategias primero..."
      Rake::Task["db:seed"].invoke
    end

    # Find or create an active collecting session
    tournament = TournamentSession
                   .where(status: %w[setup collecting])
                   .order(created_at: :desc)
                   .first_or_create!(rounds_per_match: 10, status: "collecting")

    puts "Usando TournamentSession ##{tournament.id} (status: #{tournament.status})"
    puts ""

    demo_groups = [
      { name: "Los Tigres",    pin: "1111", strategy_key: "tit_for_tat" },
      { name: "Los Dragones",  pin: "2222", strategy_key: "always_defect" },
      { name: "Los Águilas",   pin: "3333", strategy_key: "always_cooperate" },
      { name: "Los Lobos",     pin: "4444", strategy_key: "grudger" },
      { name: "Los Zorros",    pin: "5555", strategy_key: "pavlov" },
      { name: "Los Cóndores",  pin: "6666", strategy_key: "tit_for_two_tats" },
      { name: "Los Pumas",     pin: "7777", strategy_key: "suspicious_tit_for_tat" },
      { name: "Los Halcones",  pin: "8888", strategy_key: "random" },
    ]

    demo_groups.each do |attrs|
      strategy = Strategy.find_by!(key: attrs[:strategy_key])

      group = tournament.groups.find_or_initialize_by(name: attrs[:name])
      if group.new_record?
        group.pin = attrs[:pin]
        group.save!

SELECT "selections".* FROM "selections" WHERE "selections"."group_id" = 4 LIMIT 1
INSERT INTO "selections" ("created_at", "group_id", "strategy_id", "updated_at") VALUES ('2026-08-23 22:15:52.034878', 4, 1, '2026-08-23 22:15:52.034878') RETURNING "id"
---
        puts "  Ya existe: #{group.name}"
      end

      unless group.selection
        group.create_selection!(strategy: strategy)

SELECT "tournament_sessions".* FROM "tournament_sessions" ORDER BY "tournament_sessions"."created_at" DESC LIMIT 1
DELETE FROM "match_results" WHERE "match_results"."id" = 1
SELECT "groups"."id" FROM "groups" WHERE "groups"."session_id" = 1
SELECT "match_results".* FROM "match_results" WHERE (group_a_id IN (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11) OR group_b_id IN (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11))
DELETE FROM "groups" WHERE "groups"."id" = 1
SELECT "groups".* FROM "groups" WHERE "groups"."session_id" = 1
UPDATE "tournament_sessions" SET "status" = 'collecting', "updated_at" = '2026-08-23 22:22:12.042639' WHERE "tournament_sessions"."id" = 1
---
  task reset: :environment do
    tournament = TournamentSession.order(created_at: :desc).first
    unless tournament
      puts "No hay sesiones de torneo."
      next
    end

    MatchResult.where("group_a_id IN (?) OR group_b_id IN (?)",
                      tournament.groups.ids, tournament.groups.ids).destroy_all
    tournament.groups.destroy_all
    tournament.update!(status: "collecting")