app/views/admin/index.html.erb

SELECT "selections".* FROM "selections" WHERE "selections"."group_id" IN ($1, $2, $3)  [["group_id", 57], ["group_id", 56], ["group_id", 55]]
---
            <td class="py-2 text-center">
              <% if group.selection %>