app/controllers/admin_controller.rb

  def index
    @tournament      = admin_tournament
    @groups          = @tournament.groups.includes(selection: :strategy).order(:name)
    @selected_count  = @groups.count { |g| g.selection.present? }
---
SELECT "selections".* FROM "selections" WHERE "selections"."group_id" IN (3, 9, 5, 11, 7, 10, 4, 8, 2, 6, 1)
SELECT "strategies".* FROM "strategies" WHERE "strategies"."id" IN (1, 4, 3, 2, 7, 5, 6, 8)

  def run_tournament
    tournament = admin_tournament

    unless tournament.status.in?(%w[setup collecting])
      redirect_to admin_path, alert: "El torneo ya fue ejecutado. Puedes ver los resultados o reiniciarlo."
      return
    end

    groups_with_selection = tournament.groups
                                      .joins(:selection)
                                      .includes(selection: :strategy)
                                      .to_a

    if groups_with_selection.size < 2
      redirect_to admin_path, alert: "Se necesitan al menos 2 grupos con estrategia elegida para ejecutar el torneo."
      return
    end

    tournament.update!(status: "running")

    groups_with_selection.combination(2).each do |a, b|
---
SELECT "selections".* FROM "selections" WHERE "selections"."group_id" IN (2, 3, 4, 5, 6, 7, 8, 9, 10, 11)
SELECT "strategies".* FROM "strategies" WHERE "strategies"."id" IN (1, 4, 3, 2, 7, 5, 6, 8)
SELECT "selections".* FROM "selections" WHERE "selections"."group_id" IN (35, 36, 37, 38)
SELECT "strategies".* FROM "strategies" INNER JOIN "selections" ON "strategies"."id" = "selections"."strategy_id" WHERE "selections"."group_id" = 2 LIMIT 1

  def admin_tournament
    @admin_tournament ||= TournamentSession.order(created_at: :desc).first ||
                          TournamentSession.create!(rounds_per_match: 10, status: "collecting")
---
SELECT "tournament_sessions".* FROM "tournament_sessions" ORDER BY "tournament_sessions"."created_at" DESC LIMIT 1