app/controllers/admin_controller.rb

SELECT "strategies".* FROM "strategies" INNER JOIN "selections" ON "strategies"."id" = "selections"."strategy_id" WHERE "selections"."group_id" = 35 LIMIT 1
---
  def run_tournament
    tournament = admin_tournament

    unless tournament.status.in?(%w[setup collecting])
      redirect_to admin_path, alert: "El torneo ya fue ejecutado. Puedes ver los resultados o reiniciarlo."
      return
    end

    groups_with_selection = tournament.groups
                                      .joins(:selection)
                                      .includes(selection: :strategy)
                                      .to_a

    if groups_with_selection.size < 2
      redirect_to admin_path, alert: "Se necesitan al menos 2 grupos con estrategia elegida para ejecutar el torneo."
      return
    end

    tournament.update!(status: "running")

    groups_with_selection.combination(2).each do |a, b|

SELECT "tournament_sessions".* FROM "tournament_sessions" ORDER BY "tournament_sessions"."created_at" DESC LIMIT 1
---
  def admin_tournament
    @admin_tournament ||= TournamentSession.order(created_at: :desc).first ||
                          TournamentSession.create!(rounds_per_match: 50, status: "collecting")