app/controllers/admin_controller.rb

  def index
    @tournament      = admin_tournament
    @groups          = @tournament.groups.includes(selection: :strategy).order(:name)
    @selected_count  = @groups.count { |g| g.selection.present? }
---
SELECT "strategies".* FROM "strategies" WHERE "strategies"."id" IN ($1, $2, $3)  [["id", 97], ["id", 98], ["id", 99]]
SELECT "selections".* FROM "selections" WHERE "selections"."group_id" IN ($1, $2, $3)  [["group_id", 57], ["group_id", 56], ["group_id", 55]]
SELECT "strategies".* FROM "strategies" INNER JOIN "selections" ON "strategies"."id" = "selections"."strategy_id" WHERE "selections"."group_id" = $1 LIMIT $2  [["group_id", 57], ["LIMIT", 1]]

  def run_tournament
    tournament = admin_tournament

    unless tournament.status.in?(%w[setup collecting])
      redirect_to admin_path, alert: "El torneo ya fue ejecutado. Puedes ver los resultados o reiniciarlo."
      return
    end

    groups_with_selection = tournament.groups
                                      .joins(:selection)
                                      .includes(selection: :strategy)
                                      .to_a

    if groups_with_selection.size < 2
      redirect_to admin_path, alert: "Se necesitan al menos 2 grupos con estrategia elegida para ejecutar el torneo."
      return
    end

    tournament.update!(status: "running")

    groups_with_selection.combination(2).each do |a, b|
      result = GameEngine.run_match(
        a.strategy.key.to_sym,
        b.strategy.key.to_sym,
        tournament.rounds_per_match
      )

      MatchResult.create!(
        group_a:      a,
        group_b:      b,
        score_a:      result[:score_a],
        score_b:      result[:score_b],
        rounds_json:  result[:history].to_json
      )
---
SELECT "selections".* FROM "selections" WHERE "selections"."group_id" IN ($1, $2, $3)  [["group_id", 73], ["group_id", 74], ["group_id", 75]]
SELECT "strategies".* FROM "strategies" INNER JOIN "selections" ON "strategies"."id" = "selections"."strategy_id" WHERE "selections"."group_id" = $1 LIMIT $2  [["group_id", 73], ["LIMIT", 1]]
SELECT "selections".* FROM "selections" WHERE "selections"."group_id" = $1  [["group_id", 103]]
INSERT INTO "match_results" ("created_at", "group_a_id", "group_b_id", "rounds_json", "score_a", "score_b", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def reset_tournament
    tournament = admin_tournament
    MatchResult.where("group_a_id IN (?) OR group_b_id IN (?)",
                      tournament.groups.ids, tournament.groups.ids).destroy_all
---
DELETE FROM "match_results" WHERE "match_results"."id" = $1  [["id", 91]]
SELECT "match_results".* FROM "match_results" WHERE (group_a_id IN ($1, $2, $3) OR group_b_id IN ($4, $5, $6))  [[nil, 198], [nil, 199], [nil, 200], [nil, 198], [nil, 199], [nil, 200]]