app/controllers/application_controller.rb

SELECT "groups".* FROM "groups" WHERE "groups"."id" IS NULL LIMIT 1
---
  def current_group
    return @current_group if defined?(@current_group)
    @current_group = Group.find_by(id: session[:group_id])

SELECT "tournament_sessions".* FROM "tournament_sessions" WHERE "tournament_sessions"."status" IN ('setup', 'collecting') ORDER BY "tournament_sessions"."created_at" DESC LIMIT 1
---
  def active_session
    @active_session ||= TournamentSession.where(status: %w[setup collecting])
                                         .order(created_at: :desc)
                                         .first_or_create!(rounds_per_match: 10, status: "collecting")