app/controllers/groups_controller.rb

SELECT "selections".* FROM "selections" WHERE "selections"."group_id" = 2 LIMIT 1
---
  def new
    # If already logged in, go straight to strategies or waiting room
    if current_group
      redirect_to current_group.selection ? waiting_path : strategies_path

SELECT "groups".* FROM "groups" WHERE "groups"."session_id" = 1 AND "groups"."name" = 'Los halcaaones' LIMIT 1
INSERT INTO "groups" ("created_at", "name", "pin_digest", "session_id", "updated_at") VALUES ('2026-08-23 13:12:02.064494', 'Los halcaaones', '$2a$12$Yb22wPO7/1ghP4Yy.4Bei.T6V2ZP7kpcOSjyH4PxE7gVI24eyJb5S', 1, '2026-08-23 13:12:02.064494') RETURNING "id"
SELECT "selections".* FROM "selections" WHERE "selections"."group_id" = 2 LIMIT 1
---
  def create
    tournament = active_session
    name = params[:name].to_s.strip
    pin  = params[:pin].to_s.strip

    if name.blank? || pin.blank?
      flash.now[:alert] = "Nombre y PIN son obligatorios."
      return render :new, status: :unprocessable_entity
    end

    unless pin.match?(/\A\d{4}\z/)
      flash.now[:alert] = "El PIN debe ser exactamente 4 dígitos."
      return render :new, status: :unprocessable_entity
    end

    group = tournament.groups.find_by(name: name)

    if group
      # Existing group: authenticate PIN
      unless group.authenticate_pin(pin)
        flash.now[:alert] = "PIN incorrecto para ese nombre de grupo."
        return render :new, status: :unprocessable_entity
      end
    else
      # New group: create with hashed PIN
      group = tournament.groups.create!(name: name, pin: pin)
    end

    session[:group_id] = group.id
    redirect_to group.selection ? waiting_path : strategies_path,
                notice: "¡Bienvenido, #{group.name}!"

SELECT COUNT(*) FROM "groups" WHERE "groups"."session_id" = 1
SELECT COUNT(*) FROM "groups" INNER JOIN "selections" ON "selections"."group_id" = "groups"."id" WHERE "groups"."session_id" = 1
---
  def waiting
    @group    = current_group
    @strategy = @group.strategy
    @tournament = @group.session
    @total_groups   = @tournament.groups.count
    @ready_groups   = @tournament.groups.joins(:selection).count