app/controllers/matches_controller.rb

SELECT "strategies".* FROM "strategies" INNER JOIN "selections" ON "strategies"."id" = "selections"."strategy_id" WHERE "selections"."group_id" = $1 LIMIT $2  [["group_id", 1894], ["LIMIT", 1]]
---
  def index
    @group   = current_group
    @tournament = @group.session
    group_id = @group.id

    @my_matches = MatchResult
                    .where("group_a_id = ? OR group_b_id = ?", group_id, group_id)
                    .includes(:group_a, :group_b,
                              group_a: { selection: :strategy },
                              group_b: { selection: :strategy })
                    .to_a
                    .map { |mr| decorate_match(mr, @group) }
                    .sort_by { |m| -m[:my_score] }

SELECT "match_results".* FROM "match_results" WHERE "match_results"."id" = $1 LIMIT $2  [["id", 598], ["LIMIT", 1]]
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1622], ["LIMIT", 1]]
---
  def show
    @group     = current_group
    match      = MatchResult.find(params[:id])

    # Security: group can only view matches they participated in
    unless match.group_a_id == @group.id || match.group_b_id == @group.id