app/controllers/results_controller.rb

  def index
    @tournament = TournamentSession.where(status: "done").order(created_at: :desc).first

    unless @tournament
      redirect_to root_path, alert: "El torneo aún no ha finalizado."
      return
    end

    groups      = @tournament.groups.includes(selection: :strategy).to_a
    group_ids   = groups.map(&:id)
    all_matches = MatchResult.where("group_a_id IN (?) OR group_b_id IN (?)", group_ids, group_ids)
                             .includes(:group_a, :group_b)
                             .to_a

    @leaderboard = groups.map do |group|
      my_matches = all_matches.select { |m| m.group_a_id == group.id || m.group_b_id == group.id }
---
SELECT "tournament_sessions".* FROM "tournament_sessions" WHERE "tournament_sessions"."status" = $1 ORDER BY "tournament_sessions"."created_at" DESC LIMIT $2  [["status", "done"], ["LIMIT", 1]]
SELECT "groups".* FROM "groups" WHERE "groups"."id" IN ($1, $2)  [["id", 116], ["id", 117]]
SELECT "strategies".* FROM "strategies" INNER JOIN "selections" ON "strategies"."id" = "selections"."strategy_id" WHERE "selections"."group_id" = $1 LIMIT $2  [["group_id", 117], ["LIMIT", 1]]
SELECT "match_results".* FROM "match_results" WHERE (group_a_id IN ($1, $2, $3) OR group_b_id IN ($4, $5, $6))  [[nil, 116], [nil, 117], [nil, 118], [nil, 116], [nil, 117], [nil, 118]]
SELECT "groups".* FROM "groups" WHERE "groups"."id" IS NULL LIMIT $1  [["LIMIT", 1]]