app/controllers/strategies_controller.rb

  def index
    @strategies = Strategy.all.order(:name)
    @current_selection = current_group.selection
---
SELECT "selections".* FROM "selections" WHERE "selections"."group_id" = 2 LIMIT 1

  def pick
    tournament = current_group.session

    unless tournament.status.in?(%w[setup collecting])
      redirect_to waiting_path, alert: "El torneo ya está en curso; no se puede cambiar la estrategia."
      return
    end

    strategy = Strategy.find(params[:id])
    selection = current_group.selection || current_group.build_selection
    selection.strategy = strategy

    if selection.save
---
SELECT "strategies".* FROM "strategies" WHERE "strategies"."id" = 1 LIMIT 1
SELECT "selections".* FROM "selections" WHERE "selections"."group_id" = 2 LIMIT 1
INSERT INTO "selections" ("created_at", "group_id", "strategy_id", "updated_at") VALUES ('2026-08-23 13:12:11.785536', 2, 1, '2026-08-23 13:12:11.785536') RETURNING "id"
UPDATE "selections" SET "strategy_id" = 3, "updated_at" = '2026-08-23 23:08:43.673232' WHERE "selections"."id" = 19