app/controllers/strategies_controller.rb

  def index
    @strategies = Strategy.all.order(:name)
    @current_selection = current_group.selection
---
SELECT "strategies".* FROM "strategies" ORDER BY "strategies"."name" ASC
SELECT "selections".* FROM "selections" WHERE "selections"."group_id" = $1 LIMIT $2  [["group_id", 10], ["LIMIT", 1]]

  def pick
    tournament = current_group.session

    unless tournament.status.in?(%w[setup collecting])
      redirect_to waiting_path, alert: "El torneo ya está en curso; no se puede cambiar la estrategia."
      return
    end

    strategy = Strategy.find(params[:id])
    selection = current_group.selection || current_group.build_selection
    selection.strategy = strategy

    if selection.save
---
SELECT "strategies".* FROM "strategies" WHERE "strategies"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
SELECT "selections".* FROM "selections" WHERE "selections"."group_id" = $1 LIMIT $2  [["group_id", 12], ["LIMIT", 1]]
INSERT INTO "selections" ("created_at", "group_id", "strategy_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2026-08-23 13:04:45.403678"], ["group_id", 12], ["strategy_id", 24], ["updated_at", "2026-08-23 13:04:45.403678"]]
UPDATE "selections" SET "strategy_id" = $1, "updated_at" = $2 WHERE "selections"."id" = $3  [["strategy_id", 27], ["updated_at", "2026-08-23 13:04:45.499788"], ["id", 4]]